import C000 from './C000';
import P003 from './P003';
import P019 from './P019';
import P039 from './P039';
import P043 from './P043';
import P044 from './P044';
import P048 from './P048';
import P049 from './P049';
import P050 from './P050';
import P051 from './P051';

const subScreen = {
  C000, // Landing
  P003, // 제품 상세 페이지
  P019, // 찜한 상품
  P039, // 로그인 페이지
  P043, // 첫회원가입-시작하기
  P044, // 설정
  P048, // 게시판 홈
  P049, // 게시판 중분류
  P050, // 게시판 소분류
  P051, // 게시판 캐릭터 소개 페이지

  // C001, // Debug
  // C002, // Achievement
  // C003, // BetaTest Survey
  // C004, // Feedback
  // C005, // Feedback Complete'

  // P_0x, // DEBUG
  //   Landing, // 시스템 로직 상 첫 랜딩 페이지
  // P000, // 메인 탭 - P001, P003, P013 포함
  // P006, // 구매하기-렌즈 도수목록
  // P007, // 제품 구매하기
  // P009, // 구매하기-카드 목록
  // P010, // 구매하기-배송지 목록
  // P012, // 구매 완료
  // P015, // 주문 내역
  // P018, // 내 리뷰
  // P020, // 알림
  // P022, // 쿠폰
  // P024, // 카드 정보
  // P025, // 렌즈 도수표
  // P026, // 주소 정보
  // P027, // 프로필 회원 정보
  // P029, // 교환
  // P030, // 고객센터 (1:1 문의)
  // P031, // 회사 소개
  // P032, // 협력 문의
  // P041, // 첫회원가입-프로필 입력페이지
  // P042, // 첫회원가입-시작하기
  // P045, // 배송지 추가 페이지
  // P046, // 배송지 수정 페이지
  // P047, // 결제 카드 추가 페이지
  // P052, // 공지사항 / 이벤트 랜딩 페이지
  // P053, // 월간 시야 렌딩 페이지
  // P055, // 리뷰 쓰기
  // P056, // 작성 가능한 리뷰
  // P023, // 내 구독
  // P057, // 구독 상세 페이지
  // P058, // 구독 결제
  // P059, // 구독 매월 상세 내역
  // P060, // 구독 취소 페이지
  // P061, // 구독 취소 완료
  // P062, // 미리받기
  // P063, // 미리받기 완료
  // P064, // 베타테스트 피드백 작성
  // P065, // 베타테스트 피드백 완료
  // P066, // 배송 현황
  // P067, // 알림 상세 페이지
  // P068, // 리뷰 수정
  // P069, // 디버깅
  // P070, // 구독 서비스 상세 안내
  // P071, // 렌즈 도수표 작성 방법
  // P072, //
  // P073, // 구독옵션 정보수정
  // P074, // 정보수정/렌즈도수목록
  // P075, // 정보수정/배송지목록
  // P076, // 정보수정/카드목록
  // P077, // 정보수정/쿠폰목록
  // P078, // 구독 취소 (첫 구독)

  //   BetaTestStart, // 베타테스트1
  //   BetaTestSurvey, // 베타테스트 설문조사
  //   Achievement, // 도전 과제
  /*
  
  P060, // 구독 취소 페이지 
*/
};

export default subScreen;
